backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 100]
      dtype: !!python/object/apply:tensorflow.python.framework.dtypes.as_dtype [string]
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ['4wEAAAAAAAAAAQAAAAUAAABDAAAAczQAAAB0AHQBagJ0AWoDfAB0AWoEgwKDAXQBagV0BnQHZwEU

          AIMBZAGcAmQCZANkBI0DZAUZAFMAKQZOKQLaBnRva2Vuc1oMc2VxdWVuY2VfbGVucgEAAABUKQPa

          BmlucHV0c9oJc2lnbmF0dXJl2gdhc19kaWN0WgRlbG1vKQjaCmVsbW9fbW9kZWzaAnRm2gdzcXVl

          ZXpl2gRjYXN02gZzdHJpbmfaCGNvbnN0YW502gpiYXRjaF9zaXpl2gdtYXhfbGVuKQHaAXipAHIO

          AAAA+h88aXB5dGhvbi1pbnB1dC0xMC05NjJiY2FkOWQwNDA+2g1FbG1vRW1iZWRkaW5nAQAAAHMK

          AAAAAAECARIBEgICAQ==

          ', null, null]
      function_type: lambda
      name: lambda_1
      output_shape: !!python/tuple [100, 1024]
      output_shape_type: raw
      trainable: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: lambda_1
  - class_name: Bidirectional
    config:
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.2
          go_backwards: false
          implementation: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: lstm_1
          recurrent_activation: hard_sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.2
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 1024
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_1
      trainable: true
    inbound_nodes:
    - - - lambda_1
        - 0
        - 0
        - {}
    name: bidirectional_1
  - class_name: Bidirectional
    config:
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.2
          go_backwards: false
          implementation: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: lstm_2
          recurrent_activation: hard_sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.2
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 1024
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_2
      trainable: true
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - {}
    name: bidirectional_2
  - class_name: Bidirectional
    config:
      layer:
        class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          go_backwards: false
          implementation: 1
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: lstm_3
          recurrent_activation: hard_sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config: {gain: 1.0, seed: null}
          recurrent_regularizer: null
          return_sequences: true
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 1024
          unroll: false
          use_bias: true
      merge_mode: concat
      name: bidirectional_3
      trainable: true
    inbound_nodes:
    - - - bidirectional_2
        - 0
        - 0
        - {}
    name: bidirectional_3
  - class_name: Add
    config: {name: add_1, trainable: true}
    inbound_nodes:
    - - - bidirectional_1
        - 0
        - 0
        - &id001 {}
      - - bidirectional_3
        - 0
        - 0
        - *id001
    name: add_1
  - class_name: Dropout
    config: {name: dropout_1, noise_shape: null, rate: 0.5, seed: null, trainable: true}
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 64
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: softmax
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_3
          trainable: true
          units: 9
          use_bias: true
      name: time_distributed_1
      trainable: true
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: time_distributed_1
  name: model_1
  output_layers:
  - [time_distributed_1, 0, 0]
keras_version: 2.2.4
